# Пример кода: начальный уровень манипулирования данными
import pandas as pd
# Простой набор данных
data = {'Store': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Sales': [200, 220, 210, 250, 215, 240]}
df = pd.DataFrame(data)
# Группируем по Store и рассчитываем средние продажи по магазинам
avg_sales = df.groupby('Store')['Sales'].mean()
print(avg_sales)

"""
Разберем этот простой фрагмент кода:
1.импортируем библиотеку pandas;
2.создаем словарь с двумя ключами: Store и Sales. Каждому ключу поставлен в соответствие список значений;
3.создаем датафрейм на основе словаря при помощи инструкции pd.DataFrame(data);
4.применяем метод groupby() для группировки данных по столбцу Store;
5.применяем метод mean() к столбцу Sales в объекте с группами, рассчитывая средние продажи для каждого отдельного магазина;
6.сохраняем результат в переменную avg_sales и выводим ее.
7.Здесь мы вычисляем средние продажи в разрезе магазинов. 
"""

