"""Давайте применим ту же концепцию, но сделаем код более надежным, эффективным и гибким. 
Допустим, нам необходимо сгруппировать данные сразу по нескольким столбцам и вычислить несколько агрегаций, 
предварительно оставив данные только по одному магазину"""

import pandas as pd
# Чуть более сложные данные
data = {
'Store': ['A', 'B', 'A', 'B', 'A', 'B'],
'Sales': [200, 220, 210, 250, 215, 240],
'Category': ['Electronics', 'Clothing', 'Clothing', 'Electronics', 'Electronics',
'Clothing']}
df = pd.DataFrame(data)
# Группировка по полям Store и Category с вычислением разных агрегаций и фильтром на магазин A
agg_sales = df[df['Store'] == 'A'].groupby(['Store', 'Category']).agg(
    avg_sales  =('Sales', 'mean'),
    total_sales=('Sales', 'sum')
).reset_index()
print(agg_sales)

"""Изменения, которые мы внесли:
    1.Теперь в нашем словаре есть уже три ключа: Store, Sales и Category;
    3.Мы также преобразовали словарь в датафрейм;
    3.В данном случае мы воспользовались группировкой данных сразу по двум столбцам Store и Category и применили метод agg() для расчета
    сразу двух агрегаций: среднего и суммы. 
    4.Но перед этим мы отфильтровали датафрейм при помощи инструкции df[df['Store'] == 'A'], оставив в нем только магазин A;
    5.Метод reset_index() мы применили, чтобы получившийся в результате группировки датафрейм с  множественным индексом преобразовать 
    в обычный датафрейм с полями Store и Category в виде столбцов;
    6.В завершение выводим на экран итоговый датафрейм.
"""