"""Упражнение 1. Фильтрация и агрегация данных
при помощи Pandas
Есть набор данных о покупках в разных магазинах:
"""

import pandas as pd
    # Исходные данные
data = {'TransactionID': [101, 102, 103, 104, 105],
    'Store': ['A', 'B', 'A', 'C', 'B'],
    'PurchaseAmount': [250, 120, 340, 400, 200],
    'Discount': [10, 15, 20, 25, 5]}
df = pd.DataFrame(data)
# Просмотр ВСЕГО DataFrame (гарантированно)
pd.set_option('display.max_rows', None)
print("Полный DataFrame:")
print(df)
print("\n" + "="*50 + "\n")

"""Ваша задача состоит в том, чтобы:
1) отфильтровать набор данных таких образом, чтобы в  нем остались
только транзакции с суммой, превышающей 200;
2) сгруппировать транзакции по магазинам и вычислить среднюю и общую сумму покупок за вычетом скидок для каждого магазина.
Решение"""
# Шаг 1: Отфильтровать набор данных, чтобы в нем остались только транзакции с суммой, превышающей 200
filtered_df = df[df['PurchaseAmount'] > 200]
# Шаг 2: Сгруппировать транзакции по магазинам и вычислить среднюю и общую сумму покупок для каждого магазина
df['NetPurchase'] = df['PurchaseAmount'] - df['Discount']
agg_purchases = df.groupby('Store').agg(TotalPurchase=('NetPurchase', 'sum'), AvgPurchase=('NetPurchase', 'mean') )
"""agg берет кучу строк, сгруппированных по какому-то признаку, и схлопывает их в одну строку, 
применяя к ним математические функции
"""
print(filtered_df)
print("\n" + "="*50 + "\n")
print(agg_purchases)
